# **Space X  Falcon 9 First Stage Landing Prediction**

## EDA using Sqlite

**Objectives:**
* To explore dataset using Sql queries.

In [2]:
# installing sqlalchemy to execute raw sql query
%pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\acer\anaconda3\lib\site-packages (1.3.9)Note: you may need to restart the kernel to use updated packages.

### Database Connection

Installed & loaded the SQL extension.

In [3]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\acer\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (8.26.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Using cached SQLAlchemy-2.0.35-cp311-cp311-win_amd64.whl.metadata (9.9 kB)
Requirement already satisfied: sqlparse in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\acer\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\acer\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: decorator in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\acer\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\acer\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\acer\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Using cached SQLAlchemy-2.0.35-cp311-cp311-win_amd64.whl (2.1 MB)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed sqlalchemy-2.0.35
Note: you may need to restart the kernel to use updated packages.

In [4]:
%load_ext sql

Established connection with the database by importing CSV and sqlite3

In [5]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [6]:
# installed pandas
%pip install -q pandas

Note: you may need to restart the kernel to use updated packages.

In [10]:
# database URL to SQLite my_data1.db file. 
%sql sqlite:///my_data1.db

In [17]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

**Note:This below code is added to remove blank rows from table**

In [18]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

Displaying Non Null values in SPACEXTABLE

In [19]:
#Sql query to display Non Null values
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]


##### Let's explore  names of the unique launch sites in the space mission

In [20]:
%sql SELECT DISTINCT "Launch_Site" FROM SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


#####  Query to Display 5 records where launch sites begin with the string 'CCA'

In [14]:
%sql SELECT "Launch_Site" FROM SPACEXTABLE WHERE "Launch_Site" LIKE 'CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]


##### Query to display the total payload mass carried by boosters launched by NASA (CRS)

In [22]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) AS total_payload_mass FROM SPACEXTABLE WHERE Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]


##### Query to Display average payload mass carried by booster version F9 v1.1

In [23]:
%%sql 
SELECT AVG(PAYLOAD_MASS__KG_) AS average_payload_mass
FROM SPACEXTABLE
WHERE Booster_Version LIKE '%F9 v1.1%';

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

#### Query to List the date when the first succesful landing outcome in ground pad was acheived.

In [24]:
%%sql
SELECT MIN(Date) AS First_Successful_Ground_Pad_Landing_Date
FROM SPACEXTABLE
WHERE Mission_Outcome = 'Success' 
AND Landing_Outcome = 'Success (ground pad)';

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [20]:
%%sql
SELECT DISTINCT Booster_Version AS Booster_Name
FROM SPACEXTABLE
WHERE Landing_Outcome = 'Success (drone ship)'
AND PAYLOAD_MASS__KG_ > 4000
AND PAYLOAD_MASS__KG_ < 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

##### Query to List the total number of successful and failure mission outcomes

In [25]:
%%sql 
SELECT 
  SUM(CASE WHEN Mission_Outcome LIKE '%success%' THEN 1 ELSE 0 END) AS Total_Successful_Missions,
  SUM(CASE WHEN Mission_Outcome LIKE '%failure%' THEN 1 ELSE 0 END) AS Total_Failed_Missions
FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[(100, 1)]

##### Query to list the names of the booster_versions which have carried the maximum payload mass.

In [27]:
%%sql
SELECT DISTINCT Booster_Version
FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ = (
  SELECT MAX(PAYLOAD_MASS__KG_)
  FROM SPACEXTABLE
);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

#### Query to List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: used substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [29]:
%%sql
SELECT 
  CASE 
    WHEN SUBSTR(Date, 6, 2) = '01' THEN 'January'
    WHEN SUBSTR(Date, 6, 2) = '02' THEN 'February'
    WHEN SUBSTR(Date, 6, 2) = '03' THEN 'March'
    WHEN SUBSTR(Date, 6, 2) = '04' THEN 'April'
    WHEN SUBSTR(Date, 6, 2) = '05' THEN 'May'
    WHEN SUBSTR(Date, 6, 2) = '06' THEN 'June'
    WHEN SUBSTR(Date, 6, 2) = '07' THEN 'July'
    WHEN SUBSTR(Date, 6, 2) = '08' THEN 'August'
    WHEN SUBSTR(Date, 6, 2) = '09' THEN 'September'
    WHEN SUBSTR(Date, 6, 2) = '10' THEN 'October'
    WHEN SUBSTR(Date, 6, 2) = '11' THEN 'November'
    WHEN SUBSTR(Date, 6, 2) = '12' THEN 'December'
  END AS Month_Name,
  Landing_Outcome,
  Booster_Version,
  Launch_Site
FROM SPACEXTABLE
WHERE SUBSTR(Date, 1, 4) = '2015'
AND Landing_Outcome LIKE '%Failure (drone ship)%';

 * sqlite:///my_data1.db
Done.

[('January', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('April', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

#### Query to Rank the count of landing outcomes between the date 2010-06-04 and 2017-03-20, in descending order.

In [30]:
%%sql 
SELECT 
Landing_Outcome,
COUNT(*) AS Count_Landing_Outcomes
FROM SPACEXTABLE
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY Landing_Outcome
ORDER BY Count_Landing_Outcomes DESC;

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]